Public Attributes | List of all members
API_StairStructureComponentSettingsVisibilityOnStory Struct Reference
Element Manager API
Describes story's stair structure component visibility settings. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | structureVisibility [API_StairStructSymbPartNum][API_StairStructSymbVisibilityNum]
bool  | fillVisibility [API_StairStructSymbPartNum][API_StairStructSymbTypeNum]
API_MonolithPartsVisibilityData  | monolithPartsVisibility [API_StairStructSymbPartNum]
Detailed Description
Describes story's stair structure component visibility settings.
Member Data Documentation
◆ fillVisibility
 bool API_StairStructureComponentSettingsVisibilityOnStory::fillVisibility[API_StairStructSymbPartNum][API_StairStructSymbTypeNum]
◆ monolithPartsVisibility
 API_MonolithPartsVisibilityData API_StairStructureComponentSettingsVisibilityOnStory::monolithPartsVisibility[API_StairStructSymbPartNum]
◆ structureVisibility
 bool API_StairStructureComponentSettingsVisibilityOnStory::structureVisibility[API_StairStructSymbPartNum][API_StairStructSymbVisibilityNum]